       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.
       PROCEDURE DIVISION.
       MAIN SECTION.
       A.
         CALL TOTO.
       MAIN2 SECTION.
       A.
         STOP RUN.
         
