       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM1.
       PROCEDURE DIVISION.
       A.
         CALL TOTO.
       B.
         STOP RUN.
         
